// SPDX-License-Identifier: AGPL-3.0-or-later
#include "common.h"
#include "module.h"
#include "uvfmtx_rom.h"
#include "uvgfxmgr_rom.h"
#include "uvstring_rom.h"

typedef struct {
    f64 unk0;
    s32 unk8;
    u8 padC[4];
} Entry;

typedef struct {
    Entry entry[30];
} Unk802B92A0;

typedef struct UnkStruct_00402FB8_s {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
} UnkStruct_00402FB8;

typedef struct UnusedDebugStrings1_s {
    const char *dbgStrings[6];
} UnusedDebugStrings1;

typedef struct KernelDbgInfo_s {
    u8 *code;
    s32 codeSize;
    s32 form0Size;
    s32 formFilesSize;
    s32 unk10;
    s32 unk14;
} KernelDbgInfo;

// UvChannel exports
typedef struct UnkStruct_uvdbg_rom_00402FF8_s {
    char pad[0x4];
    s32 (*unk4)(s32, s32, s32 *, s32);
} UnkStruct_uvdbg_rom_00402FF8;

// UvCbck exports
typedef struct UnkStruct_uvdbg_rom_00402FFC_s {
    char pad[0x10];
    s32 (*unk10)(s32, void (*)(s32), s32, s32);
} UnkStruct_uvdbg_rom_00402FFC;

// UvGeom Exports
typedef struct UnkExports1_s {
    /* 0x00 */ char pad0[0x10];
    /* 0x10 */ void (*unk10)(s32, s32, s32, s32); /* inferred */
} UnkExports1;                                    /* size = 0x14 */

// uvFont exports
typedef struct UnkStruct_00402FD8_s {
    /* 0x00 */ char pad0[4];
    /* 0x04 */ void (*unk4)(s32);
    /* 0x08 */ char pad8[4];
    /* 0x0C */ void (*unkC)(s32, s32, s32, s32);
    /* 0x10 */ char pad10[0xC];    /* maybe part of unkC[4]? */
    /* 0x1C */ s32 (*unk1C)(void); /* inferred */
    /* 0x20 */ char pad20[4];
    /* 0x24 */ void (*unk24)(s32, s32, s8 *);
} UnkStruct_00402FD8; /* size = 0x28 */

// uvGfxState exports
typedef struct UnkStruct_00402FE4_s {
    char pad0[0xC];
    void (*unkC)(s32);
    void (*unk10)(s32);
    char pad14[0x3C];
    void (*unk50)(void);
    void (*unk54)(void);
    s32 pad58[2];
    s32 (*unk60)(s32);
} UnkStruct_00402FE4;

// UvCont exports
typedef struct UnkStruct_00402FF0_s {
    /* 0x00 */ char pad0[4];
    /* 0x04 */ s32 (*unk4)(void); /* inferred */
    /* 0x08 */ char pad8[4];
    /* 0x0C */ f32 (*unkC)(s32, s32);  /* inferred */
    /* 0x10 */ s32 (*unk10)(s32, s32); /* inferred */
    /* 0x14 */ char pad14[4];
    /* 0x18 */ s32 (*unk18)(s32, s32); /* inferred */
} UnkStruct_00402FF0;                  /* size = 0x1C */

// UvAudioMgr exports
typedef struct UnkStruct_00402FE0_s {
    s32 pad0;
    s32 (*unk4)(void);
} UnkStruct_00402FE0;

typedef struct UnkStruct_00402F34_s {
    const char *unk0;
    const char *unk4;
    const char *unk8;
    const char *unkC[2];
    const char *unk14;
    const char *unk18;
} UnkStruct_00402F34;

typedef struct UnkStruct_UvDbg_Rom_00402128_s {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC[2];
    s32 unk14;
    s32 unk18;
} UnkStruct_UvDbg_Rom_00402128;

// .bss
extern UvFMtx_Rom_Exports *D_uvdbg_rom_00402FF4;
extern UvGfxMgr_Exports *D_uvdbg_rom_00402FE8;
extern UvString_Exports *D_uvdbg_rom_00402FDC;
extern UnkExports1 *D_uvdbg_rom_00402FEC;
extern UnkStruct_uvdbg_rom_00402FF8 *D_uvdbg_rom_00402FF8;
extern UnkStruct_uvdbg_rom_00402FFC *D_uvdbg_rom_00402FFC;
extern f32 D_uvdbg_rom_00402F70;
